Camaraarthur/daemon/firmware/pendant/sdkconfig.defaults
# Honest Puck v3.2 sdkconfig defaults
# Target: ESP32-S3-WROOM-1 (N8R2 or N16R8 module)

CONFIG_IDF_TARGET="esp32s3"

# Flash: 8 MB, QIO
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: octal (WROOM-1 R8) — flip to quad if your module is R2
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Bluetooth: NimBLE host, BLE only, no BR/EDR
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# CPU: 160 MHz default (dropped from 240 for power)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Partition table: default with OTA (2 app slots) so we can add OTA later
CONFIG_PARTITION_TABLE_TWO_OTA=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Enable new I2S driver (i2s_pdm)
CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
